diplom-src/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

diplom-src/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

diplom-src/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ВКМ Начало доработки
	ВКМ_СозданиеЭлеменовФормы();
	ВКМ_ВидимостьЭлементовФормы();
	// ВКМ Конец докработки
	
КонецПроцедуры

// ВКМ Начало доработки
&НаКлиенте
Процедура ВКМ_ВидДоговораПриИзменении(Элемент)
	
	ВКМ_ВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ВКМ_ВидимостьЭлементовФормы()
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		Элементы.ВКМ_АбонементОбслуживание.Видимость = Истина;
	Иначе
		Элементы.ВКМ_АбонементОбслуживание.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВКМ_СозданиеЭлеменовФормы()

	НоваяГруппа = Элементы.Добавить("ВКМ_АбонементОбслуживание", Тип("ГруппаФормы"), ЭтаФорма);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	НоваяГруппа.ОтображатьЗаголовок = ЛОЖЬ; 
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;

	ВКМ_ДатаНачалаДействияДоговора = Элементы.Добавить("ВКМ_ДатаНачалаДействияДоговора", Тип("ПолеФормы"),НоваяГруппа);
	ВКМ_ДатаНачалаДействияДоговора.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_ДатаНачалаДействияДоговора.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
	
	ВКМ_ДатаОкончанияДействияДоговора = Элементы.Добавить("ВКМ_ДатаОкончанияДействияДоговора", Тип("ПолеФормы"),НоваяГруппа);
	ВКМ_ДатаОкончанияДействияДоговора.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_ДатаОкончанияДействияДоговора.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора";
	
	ВКМ_СуммаАбонентскойПлаты = Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"),НоваяГруппа);
	ВКМ_СуммаАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_СуммаАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	
	ВКМ_СтоимостьЧасаРаботы = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"),НоваяГруппа);
	ВКМ_СтоимостьЧасаРаботы.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_СтоимостьЧасаРаботы.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	
КонецПроцедуры
// ВКМ Конец докработки
